

Network Working Group                                          J. Jurski
Internet Draft                            Technical University of Gdansk
Document: draft-jurski-pppext-iphc-01.txt                 September 2006
Expires: March 2007
Obsoletes: 3544
Category: Informational



                      IP Header Compression over PPP



Status of this Memo

   By submitting this Internet-Draft, each author represents that any
   applicable patent or other IPR claims of which he or she is aware
   have been or will be disclosed, and any of which he or she becomes
   aware will be disclosed, in accordance with Section 6 of BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups.  Note that
   other groups may also distribute working documents as
   Internet-Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at
      http://www.ietf.org/ietf/1id-abstracts.txt

   The list of Internet-Draft Shadow Directories can be accessed at
      http://www.ietf.org/shadow.html.

   This Internet-Draft will expire on March, 21 2007.

Copyright Notice

   Copyright (C) The Internet Society (2006).  All Rights Reserved.











Jurski                   Expires - March 2007                   [Page 1]

Internet-draft      IP Header Compression over PPP        September 2006


Abstract

   This document extends RFC 3544 (which extended its predecessor,
   RFC 2509) by specifying additional negotiation options to PPP Control
   Protocols for IPv4 and IPv6 (see RFC 1332, RFC 2472).  The
   negotiation options specified in RFC 2509 defined an all-or-nothing
   strategy for applying header compression: peers were assumed to
   support compression for any combination of headers.  RFC 3544 refined
   that strategy to make it possible to negotiate header compression for
   only TCP or only non-TCP packets.  The current document further
   refines the strategy by also making it possible to negotiate header
   compression for only particular combinations of headers or header
   types.

Conventions used in this document

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED",  "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in [RFC2119].

Table of Contents

   1. Introduction..................................................3
   2. Configuration Option..........................................4
      2.1  Configuration Option Format..............................5
      2.2  RTP-Compression Suboption................................7
      2.3  Enhanced RTP-Compression Suboption.......................8
      2.4  Negotiating Header Compression for only TCP or only
           non-TCP Packets..........................................9
      2.5  Disabling Particular Header Compression Types...........10
      2.5.1  Limitations for Differential TCP Compression..........11
      2.5.2  Limitations for non-differential TCP Compression......13
      2.5.3  Limitations for non-TCP Compression...................15
   3. Multiple Network Control Protocols...........................17
      3.1  Sharing Context Identifier Space........................17
   4. Demultiplexing of Datagrams..................................17
   5. Changes from Previous RFCs and Motivation....................19
      5.1  Changes from Previous RFCs..............................19
      5.2  Motivation..............................................19
   6. References...................................................21
      6.1  Normative References....................................21
      6.2  Informative References..................................21
   7. IANA Considerations..........................................22
   8. Security Considerations......................................23
   Acknowledgments.................................................23
   Author's Address................................................24
   Intellectual Property Statement.................................24
   Full Copyright Statement........................................24



Jurski                   Expires - March 2007                   [Page 2]

Internet-draft      IP Header Compression over PPP        September 2006


1. Introduction

   The IP Header Compression (IPHC) defined in [RFC2507] may be used for
   compression of both IPv4 and IPv6 datagrams or packets encapsulated
   with multiple IP headers.  IPHC is also capable of compressing both
   TCP and UDP transport protocol headers.  The IP/UDP/RTP header
   compression defined in [RFC2508] and [RFC3545] fits within the
   framework defined by IPHC so that it may also be applied to both IPv4
   and IPv6 packets.

   In order to establish compression of IP datagrams sent over a PPP
   link each end of the link must agree on a set of configuration
   parameters for the compression.  The process of negotiating link
   parameters for network layer protocols is handled in PPP by a family
   of network control protocols (NCPs).  Since there are separate NCPs
   for IPv4 and IPv6, this document defines configuration options to be
   used in both NCPs to negotiate parameters for the compression scheme.

   This document obsoletes RFC 2509 and RFC 3544, adding new suboptions
   to the IP header compression configuration option.  By using these
   new suboptions, the decompressor can request that the use of
   compression for particular header types or combinations of headers in
   the datagram is disabled.

   IPHC relies on the link layer's ability to indicate the types of
   datagrams carried in the link layer frames.  In this document nine
   new types for the PPP Data Link Layer Protocol Field are defined
   along with their meaning.

   In general, header compression schemes that use delta encoding of
   compressed packets require that the lower layer does not reorder
   packets between compressor and decompressor.  IPHC uses delta
   encoding of compressed packets for TCP and RTP.  The IPHC
   specification [RFC2507] includes methods that allow link layers that
   may reorder packets to be used with IPHC.  Since PPP does not reorder
   packets these mechanisms are disabled by default.  When using
   reordering mechanisms such as multiclass multilink PPP [RFC2686],
   care must be taken so that packets that share the same compression
   context are not reordered.












Jurski                   Expires - March 2007                   [Page 3]

Internet-draft      IP Header Compression over PPP        September 2006


2. Configuration Option

   This document specifies a new compression protocol value for the IPCP
   IP-Compression-Protocol option as specified in [RFC1332].  The new
   value and the associated option format are described in section 2.1.

   The option format is structured to allow future extensions to the
   IPHC scheme.

   NOTE: The specification of link and network layer parameter
      negotiation for PPP [RFC1661], [RFC1331], [RFC1332] does not
      prohibit multiple instances of one configuration option but states
      that the specification of a configuration option must explicitly
      allow multiple instances.  [RFC3241] updates RFC 1332 by
      explicitly allowing the sending of multiple instances of the IP-
      Compression-Protocol configuration option, each with a different
      value for IP-Compression-Protocol.  Each type of compression
      protocol may independently establish its own parameters.

   NOTE: [RFC1332] is not explicit about whether the option negotiates
      the capabilities of the receiver or of the sender.  In keeping
      with current practice, we assume that the option describes the
      capabilities of the decompressor (receiving side) of the peer that
      sends the Config-Req.



























Jurski                   Expires - March 2007                   [Page 4]

Internet-draft      IP Header Compression over PPP        September 2006


2.1  Configuration Option Format

   Both the network control protocol for IPv4, IPCP [RFC1332] and the
   IPv6 NCP, IPV6CP [RFC2472] may be used to negotiate IP Header
   Compression parameters for their respective protocols.  The format of
   the configuration option is the same for both IPCP and IPV6CP.

   Description

      This NCP configuration option is used to negotiate parameters for
      IP Header Compression.  Successful negotiation of parameters
      enables the use of Protocol Identifiers FULL_HEADER,
      COMPRESSED_TCP, COMPRESSED_TCP_NODELTA, COMPRESSED_NON_TCP and
      CONTEXT_STATE as specified in [RFC2507].  The option format is
      summarized below.  The fields are transmitted from left to right.

       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |     Type      |    Length     |    IP-Compression-Protocol    |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |           TCP_SPACE           |         NON_TCP_SPACE         |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |         F_MAX_PERIOD          |          F_MAX_TIME           |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |           MAX_HEADER          |          suboptions...
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   Type
      2

   Length
      >= 14

   The length may be increased if the presence of additional parameters
   is indicated by additional suboptions.

   IP-Compression-Protocol
      0061 (hex)

   TCP_SPACE
      The TCP_SPACE field is two octets and indicates the maximum value
      of a context identifier in the space of context identifiers
      allocated for TCP.

         Suggested value: 15

      TCP_SPACE must be at least 0 and at most 255 (the value 0 implies
      having one context).


Jurski                   Expires - March 2007                   [Page 5]

Internet-draft      IP Header Compression over PPP        September 2006



   NON_TCP_SPACE
      The NON_TCP_SPACE field is two octets and indicates the maximum
      value of a context identifier in the space of context identifiers
      allocated for non-TCP.  These context identifiers are carried in
      COMPRESSED_NON_TCP, COMPRESSED_UDP and COMPRESSED_RTP packet
      headers.

         Suggested value: 15

      NON_TCP_SPACE must be at least 0 and at most 65535 (the value 0
      implies having one context).

   F_MAX_PERIOD
      Maximum interval between full headers.  No more than F_MAX_PERIOD
      COMPRESSED_NON_TCP headers may be sent between FULL_HEADER
      headers.

         Suggested value: 256

      A value of zero implies infinity, i.e. there is no limit to the
      number of consecutive COMPRESSED_NON_TCP headers.

   F_MAX_TIME
      Maximum time interval between full headers.  COMPRESSED_NON_TCP
      headers may not be sent more than F_MAX_TIME seconds after sending
      the last FULL_HEADER header.

         Suggested value: 5 seconds

      A value of zero implies infinity.

   MAX_HEADER
      The largest header size in octets that may be compressed.

         Suggested value: 168 octets

      The value of MAX_HEADER should be large enough so that at least
      the outer network layer header can be compressed.  To increase
      compression efficiency MAX_HEADER should be set to a value large
      enough to cover common combinations of network and transport layer
      headers.









Jurski                   Expires - March 2007                   [Page 6]

Internet-draft      IP Header Compression over PPP        September 2006


   suboptions
      The suboptions field consists of zero or more suboptions.  Each
      suboption consists of a type field, a length field and zero or
      more parameter octets, as defined by the suboption type.  The
      value of the length field indicates the length of the suboption in
      its entirety, including the lengths of the type and length fields.

       0                   1                   2
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |     Type      |    Length     |  Parameters...
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


2.2  RTP-Compression Suboption

   The RTP-Compression suboption is included in the NCP IP-Compression-
   Protocol option for IPHC if IP/UDP/RTP compression is to be enabled.

   Inclusion of the RTP-Compression suboption enables use of additional
   Protocol Identifiers COMPRESSED_RTP and COMPRESSED_UDP along with
   additional forms of CONTEXT_STATE as specified in [RFC2508].

   Description

      Enable use of Protocol Identifiers COMPRESSED_RTP, COMPRESSED_UDP
      and CONTEXT_STATE as specified in [RFC2508].

       0                   1
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |     Type      |    Length     |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   Type
      1

   Length
      2












Jurski                   Expires - March 2007                   [Page 7]

Internet-draft      IP Header Compression over PPP        September 2006


2.3  Enhanced RTP-Compression Suboption

   To use the enhanced RTP header compression defined in [RFC3545], a
   new sub-option 2 is added.  Sub-option 2 is negotiated instead of,
   not in addition to, sub-option 1.

   Description

      Enable use of Protocol Identifiers COMPRESSED_RTP and
      CONTEXT_STATE as specified in [RFC2508].  In addition, enable use
      of [RFC3545] compliant compression including the use of Protocol
      Identifier COMPRESSED_UDP with additional flags and use of the C
      flag with the FULL_HEADER Protocol Identifier to indicate use of
      HDRCKSUM with COMPRESSED_RTP and COMPRESSED_UDP packets.

       0                   1
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |     Type      |    Length     |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   Type
      2

   Length
      2

























Jurski                   Expires - March 2007                   [Page 8]

Internet-draft      IP Header Compression over PPP        September 2006


2.4  Negotiating Header Compression for only TCP or only non-TCP
     Packets

   In RFC 2509 it was not possible to negotiate only TCP header
   compression or only non-TCP header compression because a value of 0
   in the TCP_SPACE or the NON_TCP_SPACE fields actually means that 1
   context is negotiated.

   A new suboption 3 is added to allow specifying that the number of
   contexts for TCP_SPACE or NON_TCP_SPACE is zero, disabling use of the
   corresponding compression.

   Description

      Enable header compression for only TCP or only non-TCP packets.

       0                   1                   2
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |     Type      |    Length     |   Parameter   |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   Type
      3

   Length
      3

   Parameter

      The parameter is 1 byte with one of the following values:
      1 = the number of contexts for TCP_SPACE is 0
      2 = the number of contexts for NON_TCP_SPACE is 0

   This suboption overrides the values that were previously assigned to
   TCP_SPACE and NON_TCP_SPACE in the IP Header Compression option.

   If suboption 3 is included multiple times with parameter 1 and 2,
   compression is disabled for all packets.












Jurski                   Expires - March 2007                   [Page 9]

Internet-draft      IP Header Compression over PPP        September 2006


2.5  Disabling Particular Header Compression Types

   According to RFC 2509, the peers compressed and decompressed all
   combinations of headers.  Therefore, it was not possible to disable
   compression for a particular header type or a combination of headers.
   For example, even nodes that only supported IPv4 had to support IPv6
   header compression because it was impossible to specify that IPv6
   headers shall not be compressed.

   Three new suboptions 4, 5, and 6 are added to make it possible for a
   decompressor to specify which particular types of headers or their
   combinations MUST NOT be compressed by a compressor.  Separate sets
   of limitations are defined in the following subsections for
   differential TCP, non-differential TCP, and non-TCP compression
   methods.

   However, the compression limitations specified in these suboptions
   should be used with care.  Indiscriminate use of these limitations
   may lead to suboptimal compression, or even no compression.  General
   purpose systems SHOULD normally request no limitation and use the
   full compression functionality defined in RFC 2509.  The decompressor
   MAY only be configured to request limited compression if there is no
   benefit from a particular header compression type.  For each system,
   advantages and disadvantages must be carefully examined (see
   discussion in section 5.2), including scenarios when the compressor
   may not fully support all combinations of flags specified in this
   suboption.  Although new implementations of the compressor are
   expected to support this suboption, there are many older systems that
   do not support it.  The decompressor SHOULD agree on the full
   RFC 2509 compression if it receives a request from an older peer
   (compressor).

   Note that flag A of suboption 4 and flag B of suboption 5 overlap
   with suboption 3 with parameter 1.  For this reason, in order to
   avoid a suboptimal NCP negotiation exchange, peers SHOULD use
   suboption 3 with parameter 1 to completely disable TCP compression,
   instead of setting both flags A and B in suboption 4 and 5.
   Accordingly, peers implementing suboptions 4 and 5 SHALL also
   understand suboption 3.












Jurski                   Expires - March 2007                  [Page 10]

Internet-draft      IP Header Compression over PPP        September 2006


2.5.1  Limitations for Differential TCP Compression

   This suboption defines limitations that apply for the differential
   encoding compression method only.

   Description

      Disable differential TCP header compression for a particular
      compression method(s), header type(s), or header combination(s).

       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |     Type      |    Length     |A B C D E F G|    Reserved     |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   Type
      4

   Length
      = 4

   Flags (ABCDEFG)

      This field is a set of bit-flags that specify limitations.  A flag
      set refers to a particular limitation:

         A: TCP differential encoding method shall not be used at all
            ([RFC2507], Section 7.12.1);  if this flag is set, the
            remaining flags are irrelevant (MUST be set to zero by the
            sender and ignored by the receiver)

         B: Unused – MUST be set to zero by the sender and ignored by
            the receiver

         C: IPv4 header can be compressed only if it is the first header
            in the compression chain (i.e. tunneled IPv4 headers are not
            compressed and break the compression chain of headers);  if
            this flag is set for IPv6 Control Protocol, IPv4 header
            compression is completely disabled (see Section 3 for
            explanation)

         D: IPv6 base header can be compressed only if it is the first
            header in the compression chain (i.e. tunneled IPv6 headers
            are not compressed and break the compression chain of
            headers);  if this flag is set for IP Control Protocol, IPv6
            header compression is completely disabled (see Section 3 for
            explanation)



Jurski                   Expires - March 2007                  [Page 11]

Internet-draft      IP Header Compression over PPP        September 2006


         E: IPv4 header for a fragment or with options shall not be
            compressed ([RFC2507], Section 7.13, point b);  this flag is
            irrelevant if IPv4 header compression is completely disabled

         F: IPv6 extension headers shall not be compressed ([RFC2507],
            Sections from 7.1 to 7.10);  this flag is irrelevant if IPv6
            header compression is completely disabled

         G: minimal encapsulation header shall not be compressed
            ([RFC2507], Section 7.14)

   Reserved

      MUST be set to zero by the sender and ignored by the receiver.

   This suboption SHOULD NOT be included in an NCP message if suboption
   3 with parameter 1 is included.

   If this suboption is included multiple times, the sum of all the
   limitations applies (logical-or on all flags).































Jurski                   Expires - March 2007                  [Page 12]

Internet-draft      IP Header Compression over PPP        September 2006


2.5.2  Limitations for non-differential TCP Compression

   This suboption defines limitations that apply for the
   non-differential encoding compression method only.

   Description

      Disable non-differential TCP header compression for a particular
      compression method(s), header type(s), or header combination(s).

       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |     Type      |    Length     |A B C D E F G|    Reserved     |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   Type
      5

   Length
      = 4

   Flags (ABCDEFG)

      This field is a set of bit-flags that specify limitations.  A flag
      set refers to a particular limitation:

         A: Unused – MUST be set to zero by the sender and ignored by
            the receiver

         B: TCP non-differential encoding method shall not be used
            ([RFC2507], Section 7.12.2);  if this flag is set, the
            remaining flags are irrelevant (MUST be set to zero by the
            sender and ignored by the receiver)

         C: IPv4 header can be compressed only if it is the first header
            in the compression chain (i.e. tunneled IPv4 headers are not
            compressed and break the compression chain of headers);  if
            this flag is set for IPv6 Control Protocol, IPv4 header
            compression is completely disabled (see Section 3 for
            explanation)

         D: IPv6 base header can be compressed only if it is the first
            header in the compression chain (i.e. tunneled IPv6 headers
            are not compressed and break the compression chain of
            headers);  if this flag is set for IP Control Protocol, IPv6
            header compression is completely disabled (see Section 3 for
            explanation)



Jurski                   Expires - March 2007                  [Page 13]

Internet-draft      IP Header Compression over PPP        September 2006


         E: IPv4 header for a fragment or with options shall not be
            compressed ([RFC2507], Section 7.13, point b);  this flag is
            irrelevant if IPv4 header compression is completely disabled

         F: IPv6 extension headers shall not be compressed ([RFC2507],
            Sections from 7.1 to 7.10);  this flag is irrelevant if IPv6
            header compression is completely disabled

         G: minimal encapsulation header shall not be compressed
            ([RFC2507], Section 7.14)

   Reserved

      MUST be set to zero by the sender and ignored by the receiver.

   This suboption SHOULD NOT be included in an NCP message if suboption
   3 with parameter 1 is included.

   If this suboption is included multiple times, the sum of all the
   limitations applies (logical-or on all flags).































Jurski                   Expires - March 2007                  [Page 14]

Internet-draft      IP Header Compression over PPP        September 2006


2.5.3  Limitations for non-TCP Compression

   This suboption defines limitations that apply for the non-TCP
   compression method only.

   Description

      Disable non-TCP header compression for a particular compression
      method(s), header type(s), or header combination(s).

       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |     Type      |    Length     |A B C D E F G H I J K| Reserved|
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   Type
      6

   Length
      = 4

   Flags (ABCDEFGHIJK)

      This field is a set of bit-flags that specify limitations.  A flag
      set refers to a particular limitation:

         A: Unused – MUST be set to zero by the sender and ignored by
            the receiver

         B: Unused – MUST be set to zero by the sender and ignored by
            the receiver

         C: IPv4 header can be compressed only if it is the first header
            in the compression chain (i.e. tunneled IPv4 headers are not
            compressed and break the compression chain of headers);  if
            this flag is set for IPv6 Control Protocol, IPv4 header
            compression is completely disabled (see Section 3 for
            explanation)

         D: IPv6 base header can be compressed only if it is the first
            header in the compression chain (i.e. tunneled IPv6 headers
            are not compressed and break the compression chain of
            headers);  if this flag is set for IP Control Protocol, IPv6
            header compression is completely disabled (see Section 3 for
            explanation)





Jurski                   Expires - March 2007                  [Page 15]

Internet-draft      IP Header Compression over PPP        September 2006


         E: IPv4 header for a fragment or with options shall not be
            compressed ([RFC2507], Section 7.13, point b);  this flag is
            irrelevant if IPv4 header compression is completely disabled

         F: IPv6 extension headers shall not be compressed ([RFC2507],
            Sections from 7.1 to 7.10);  this flag is irrelevant if IPv6
            header compression is completely disabled

         G: minimal encapsulation header shall not be compressed
            ([RFC2507], Section 7.14)

         H: UDP headers with non-zero UDP checksum shall not be
            compressed ([RFC2507], Section 7.11); note that the checksum
            cannot be zero with IPv6

         I: the compressed chain of headers must include a compressed
            UDP or a compressed RTP header;  if the compressible chain
            of headers does not include a UDP or RTP header, the whole
            chain cannot be compressed

         J: the compressed chain of headers must include a compressed
            RTP header;  if the compressible chain of headers does not
            include a RTP header, the whole chain cannot be compressed;
            this flag is irrelevant if flag I is set;  this flag MUST be
            set to zero by the sender and ignored by the receiver if RTP
            compression is not enabled (with use of suboption 1 or 2 as
            specified in Section 2.2 or 2.3, respectively)

         K: RTP headers with non-empty CSRC list shall not be compressed
            ([RFC2508], Section 3.3.2);  this flag MUST be set to zero
            by the sender and ignored by the receiver if RTP compression
            is not enabled

   Reserved

      MUST be set to zero by the sender and ignored by the receiver.

   This suboption SHOULD NOT be included in an NCP message if suboption
   3 with parameter 2 is included.

   If this suboption is included multiple times, the sum of all the
   limitations applies (logical-or on all flags).









Jurski                   Expires - March 2007                  [Page 16]

Internet-draft      IP Header Compression over PPP        September 2006


3. Multiple Network Control Protocols

   The IPHC protocol is able to compress both IPv4 and IPv6 datagrams.
   Both IPCP and IPV6CP are able to negotiate option parameter values
   for IPHC.  These values apply to the compression of packets where the
   outer header is an IPv4 header and an IPv6 header, respectively.

3.1  Sharing Context Identifier Space

   For the compression and decompression of IPv4 and IPv6 datagram
   headers the context identifier space is shared.  While the parameter
   values are independently negotiated, sharing the context identifier
   spaces becomes more complex when the parameter values differ.  Since
   the compressed packets share context identifier space, the
   compression engine must allocate context identifiers out of a common
   pool; for compressed packets, the decompressor has to examine the
   context state to determine what parameters to use for decompression.

   Context identifier spaces are not shared between TCP and non-
   TCP/UDP/RTP.  Doing so would require additional mechanisms to ensure
   that no error can occur when switching from using a context
   identifier for TCP to non-TCP.

4. Demultiplexing of Datagrams

   The IPHC specification [RFC2507] defines four header formats for
   different types of compressed headers.  They are compressed TCP,
   compressed TCP with no delta encoding, compressed non-TCP with 8 bit
   CID and compressed non-TCP with 16 bit CID.  The two non-TCP formats
   may be distinguished by their contents so both may use the same
   link-level identifier.  A fifth header format, the full header is
   distinct from a regular header in that it carries additional
   information to establish shared context between the compressor and
   decompressor.

   The specification of IP/UDP/RTP Header Compression [RFC2508] defines
   four additional formats of compressed headers.  They are for
   compressed UDP and compressed RTP (on top of UDP), both with either
   8- or 16-bit CIDs.  In addition, there is an explicit error message
   from the decompressor to the compressor.

   The link layer must be able to indicate these header formats with
   distinct values.  Nine PPP Data Link Layer Protocol Field values are
   specified below.







Jurski                   Expires - March 2007                  [Page 17]

Internet-draft      IP Header Compression over PPP        September 2006


   FULL_HEADER
      The frame contains a full header as specified in [RFC2508] Section
      3.3.1.  This is the same as the FULL_HEADER specified in [RFC2507]
      Section 5.3.
         Value: 0061 (hex)

   COMPRESSED_TCP
      The frame contains a datagram with a compressed header with the
      format as specified in [RFC2507] Section 6a.
         Value: 0063 (hex)

   COMPRESSED_TCP_NODELTA
      The frame contains a datagram with a compressed header with the
      format as specified in [RFC2507] Section 6b.
         Value: 2063 (hex)

   COMPRESSED_NON_TCP
      The frame contains a datagram with a compressed header with the
      format as specified in either Section 6c or Section 6d of
      [RFC2507].
         Value: 0065 (hex)

   COMPRESSED_RTP_8
      The frame contains a datagram with a compressed header with the
      format as specified in [RFC2508] Section 3.3.2, using 8-bit CIDs.
         Value: 0069 (hex)

   COMPRESSED_RTP_16
      The frame contains a datagram with a compressed header with the
      format as specified in [RFC2508] Section 3.3.2, using 16-bit CIDs.
         Value: 2069 (hex)

   COMPRESSED_UDP_8
      The frame contains a datagram with a compressed header with the
      format as specified in [RFC2508] Section 3.3.3 or as specified in
      [RFC3545] Section 2.1, using 8-bit CIDs.
         Value: 0067 (hex)

   COMPRESSED_UDP_16
      The frame contains a datagram with a compressed header with the
      format as specified in [RFC2508] Section 3.3.3 or as specified in
      [RFC3545] Section 2.1, using 16-bit CIDs.
         Value: 2067 (hex)

   CONTEXT_STATE
      The frame is a link-level message sent from the decompressor to
      the compressor as specified in [RFC2508] Section 3.3.5.
         Value: 2065 (hex)



Jurski                   Expires - March 2007                  [Page 18]

Internet-draft      IP Header Compression over PPP        September 2006


5. Changes from Previous RFCs and Motivation

5.1  Changes from Previous RFCs

   Most of this document is identical to RFC 3544 and RFC 2509.  The new
   suboptions are only defined in Section 2.5.

   Note that the new suboptions (defined in RFC 3544 and in this
   document) modify the stopping criteria specified in [RFC2507] in
   Section 7.  This can be considered as adding a new subpoint "c)" to
   the list in the first paragraph of Section 7 in [RFC2507].  This new
   point would specify that the compressible chain of headers would be
   additionally limited by the new suboptions.

5.2  Motivation

   There is always a need to efficiently use system resources, such as
   link capacity, processing power, and memory.  These resources are
   usually limited.

   IPHC makes efficient use of link capacity at the expense of
   additional processing power and memory.  It requires the peers to be
   able to decompress (not necessarily compress) all combinations of
   headers, using all algorithms defined in [RFC2507].  This is a good
   solution for general purpose equipment, such as Internet routers.

   There are, however, specific applications that do not benefit from
   most of the functionality offered by IPHC (in other words, such
   applications may waste their resources).  For example, equipment that
   transports mainly VoIP data encapsulated in IP/UDP/RTP headers and
   only rarely expects other types of packets could make the most
   efficient use of available resources by using compression for only
   IP/UDP/RTP headers.  In this manner, it could support more IP/UDP/RTP
   compression contexts improving overall compression efficiency.  This
   would come at the cost of not supporting compression for other
   combinations of headers, but the assumption is that other
   combinations are not needed in this case (or they are very rare).
   This document makes it possible.

   Note that, while the compressor could use heuristics to determine the
   most efficient way to compress flows, the decompressor may be in a
   much better position to know the expected traffic type and resource
   limitations.  For example, a compressor (at a service provider) that
   supports a variety of customers is unable to predict the type of
   traffic carried for a specific customer, while the decompressor at
   the customer's site often knows the expected traffic precisely.
   Similarly, if the decompressor can decompress only, for example,
   either 1000 TCP flows with the non-differential compression method or
   just 500 TCP flows with the differential compression method, and the


Jurski                   Expires - March 2007                  [Page 19]

Internet-draft      IP Header Compression over PPP        September 2006


   expectation is that there will be 1000 flows, it may be more
   beneficial to ask the compressor to use only the non-differential
   compression.  This could potentially limit per-flow compression
   efficiency but improve the overall compression efficiency.  Note also
   that there is no way of making dynamic adjustments in the negotiated
   values for IPHC protocol, because the decompressor is always expected
   to correctly handle incoming traffic according to the negotiated
   parameters.

   However, a request for these new suboptions by a decompressor might
   cause inefficient use of the available link capacity.  Especially
   because many compressors do not support these new suboptions and may
   not support it in the future.  Therefore, the decompressor shall only
   request limited compression if it does not benefit from a particular
   header compression type.  And for this reason, the new suboptions are
   designed backward-compatible, so that peers that do not support the
   new suboptions can interoperate with peers that support them by using
   the full functionality defined in RFC 2509.

   It may seem that CPU speed or memory size limitations are ephemeral
   issues nowadays and such savings are worthless.  The author of this
   document believes that even if memory and processing power are cheap,
   there is still a desire to make a more efficient use of them simply
   because the resources are limited.  Mobile equipment (which must be
   lightweight), satellite systems (which cannot be upgraded during
   their lifetime), or even high-capacity high-speed media gateways
   carrying thousands of compressible connections (which require
   gigabytes of memory for IPHC) are good examples of systems that could
   benefit from the new extensions.  The benefits will not only include
   memory and processing power savings but also improved overall
   compression efficiency.  This is a good reason to add the new
   suboptions to the protocol.

   The author is aware that the new suboptions represent an additional
   cost to the community that implements and tests this protocol.  There
   are however more and more specialized applications that could greatly
   benefit from these new suboptions.  Moreover, by controlling the
   trade-off between compression efficiency and resource usage, proposed
   extensions make the protocol more flexible and suitable in more
   various usage scenarios.  This may also be beneficial for reasons
   which cannot be seen directly.  For example, instead of supporting
   full compression for 500 users one can provide a limited compression
   to 1000 users, thus supporting all users with equal capabilities.








Jurski                   Expires - March 2007                  [Page 20]

Internet-draft      IP Header Compression over PPP        September 2006


6. References

6.1  Normative References

   [RFC1144]  Jacobson, V., "Compressing TCP/IP Headers for low-speed
              serial links", RFC 1144, February 1990.

   [RFC1332]  McGregor, G., "The PPP Internet Protocol Control Protocol
              (IPCP)", RFC 1332, May 1992.

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119, March 1997.

   [RFC2472]  Haskin, D. and E. Allen, "IP Version 6 over PPP", RFC
              2472, December 1998.

   [RFC2507]  Degermark, M., Nordgren, B. and S. Pink, "Header
              Compression for IP", RFC 2507, February 1999.

   [RFC2508]  Casner, S. and V. Jacobson, "Compressing IP/UDP/RTP
              Headers for Low-Speed Serial Links", RFC 2508, February
              1999.

   [RFC3241]  Bormann, C., "Robust Header Compression (ROHC) over PPP",
              RFC 3241, April 2002.

   [RFC3545]  Koren, T., Casner, S., Geevarghese, J., Thompson, B. and
              P. Ruddy, "Enhanced Compressed RTP (CRTP) for Links with
              High Delay, Packet Loss and Reordering", RFC 3545, July
              2003.

6.2  Informative References

   [RFC1661]  Simpson, W., Ed., "The Point-To-Point Protocol (PPP)",
              STD 51, RFC 1661, July 1994.

   [RFC2434]  Narten, T. and H. Alvestrand, "Guidelines for Writing an
              IANA Considerations Section in RFCs", BCP 26, RFC 2434,
              October 1998.

   [RFC2686]  Bormann, C., "The Multi-Class Extension to Multi-Link
              PPP", RFC 2686, September 1999.

   [RFC3550]  Schulzrinne, H., Casner, S., Frederick, R. and V.
              Jacobson, "RTP: A Transport Protocol for Real-Time
              Applications", RFC 3550, July 2003.





Jurski                   Expires - March 2007                  [Page 21]

Internet-draft      IP Header Compression over PPP        September 2006


7. IANA Considerations

   This document does not require any additional allocations from
   existing namespaces in the IANA Point-to-Point Protocol Field
   Assignments registry.  However, there are three namespaces that were
   defined by RFC 1332, RFC 2472, and RFC 2509 but not created in the
   registry.  Those three namespaces, described below, have been added
   to the PPP registry.  This document specifies two additional
   allocations in the third one.

   Section 3.2 of RFC 1332 specifies an IP-Compression-Protocol
   Configuration Option for the PPP IP Control Protocol and defines one
   value for the IP-Compression-Protocol type field in that option.  An
   IANA registry has been created to allocate additional values for that
   type field.  As stated in RFC 1332, the values for the
   IP-Compression-Protocol type field are always the same as the
   (primary) PPP DLL Protocol Number assigned to packets of the
   particular compression protocol.  Assignment of additional IP-
   Compression-Protocol type values is through the IETF consensus
   procedure as specified in [RFC2434].

   Section 4.2 of RFC 2472 specifies an IPv6-Compression-Protocol
   Configuration Option for the PPP IPv6 Control Protocol and defines
   one value for the IPv6-Compression-Protocol type field in that
   option.  An IANA registry has been created to allocate additional
   values for that type field.  The IPv6-Compression-Protocol
   Configuration Option has the same structure as the IP-Compression-
   Protocol Configuration Option defined in RFC 1332, but the set of
   values defined for the type field may be different.  As stated in RFC
   2472, the values for the IPv6-Compression-Protocol type field are
   always the same as the (primary) PPP DLL Protocol Number assigned to
   packets of the particular compression protocol.  Assignment of
   additional IPv6-Compression-Protocol type values is through the IETF
   consensus procedure as specified in [RFC2434].

   Section 2.1 of RFC 2509 (repeated in RFC 3544) specifies an
   additional type value to be registered for both the IP-Compression-
   Protocol Configuration Option and the IPv6-Compression-Protocol
   Configuration Option to indicate use of the "IP Header Compression"
   protocol.  The specification of that type value is repeated in
   Section 2.1 of this document which obsoletes RFC 3544.  In
   conjunction with the additional type value, the format for the
   variable-length option is specified.  The format includes a suboption
   field that may contain one or more suboptions.  Each suboption begins
   with a suboption type value.  An IANA registry has been created for
   the suboption type values; and is titled, "IP Header Compression
   Configuration Option Suboption Types".




Jurski                   Expires - March 2007                  [Page 22]

Internet-draft      IP Header Compression over PPP        September 2006


   Section 2.2 of RFC 2509 (repeated in this document) defines one
   suboption type.  Sections 2.3 and 2.4 of RFC 3544 (repeated in this
   document) define two additional suboption types.  Section 2.5 of this
   document defines three additional suboption types.  It is expected
   that the number of additional suboptions that will need to be defined
   is small.  Therefore, anyone wishing to define new suboptions is
   required to produce a revision of this document to be vetted through
   the normal Internet Standards process, as specified in [RFC2434].

   RFC 2509 also defines nine PPP Data Link Layer Protocol Field values
   which are already listed in the IANA registry of Point-to-Point
   Protocol Field Assignments.  Section 4 of this document repeats the
   specification of those values without change.

8. Security Considerations

   Negotiation of the option defined here imposes no additional security
   considerations beyond those that otherwise apply to PPP [RFC1661].

   The use of header compression can, in rare cases, cause the
   misdelivery of packets.  If necessary, confidentiality of packet
   contents should be assured by encryption.  Encryption applied at the
   IP layer (e.g., using IPSEC mechanisms) precludes header compression
   of the encrypted headers, though compression of the outer IP header
   and authentication/security headers is still possible as described in
   [RFC2507].  For RTP packets, full header compression is possible if
   the RTP payload is encrypted by itself without encrypting the UDP or
   RTP headers, as described in [RFC3550].  This method is appropriate
   when the UDP and RTP header information need not be kept
   confidential.

Acknowledgments

   The author would like to thank particularly to Piotr Uminski for his
   contribution to this document and to James Carlson and Carsten
   Bormann for their critical comments regarding the new suboptions.

   Mathias Engan, Stephen L. Casner, Carsten Bormann, and Tmima Koren
   are the authors of RFC 2509 and RFC 3544 documents, of which this
   document is a revision.











Jurski                   Expires - March 2007                  [Page 23]

Internet-draft      IP Header Compression over PPP        September 2006


Author's Address

   Janusz Jurski
   Technical University of Gdansk
   ul. Narutowicza 11/12
   80-952 Gdansk
   Poland
   Email: jjurski@eti.pg.gda.pl

Intellectual Property Statement

   The IETF takes no position regarding the validity or scope of any
   Intellectual Property Rights or other rights that might be claimed to
   pertain to the implementation or use of the technology described in
   this document or the extent to which any license under such rights
   might or might not be available; nor does it represent that it has
   made any independent effort to identify any such rights.  Information
   on the ISOC's procedures with respect to rights in ISOC Documents can
   be found in BCP 78 and BCP 79.

   Copies of IPR disclosures made to the IETF Secretariat and any
   assurances of licenses to be made available, or the result of an
   attempt made to obtain a general license or permission for the use of
   such proprietary rights by implementers or users of this
   specification can be obtained from the IETF on-line IPR repository at
   http://www.ietf.org/ipr.

   The IETF invites any interested party to bring to its attention any
   copyrights, patents or patent applications, or other proprietary
   rights that may cover technology that may be required to implement
   this standard.  Please address the information to the IETF at
   ietf-ipr@ietf.org.

Full Copyright Statement

   Copyright (C) The Internet Society (2006).

   This document is subject to the rights, licenses and restrictions
   contained in BCP 78, and except as set forth therein, the authors
   retain all their rights.

   This document and the information contained herein are provided on an
   "AS IS" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS
   OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET
   ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED,
   INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE
   INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED
   WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.



Jurski                   Expires - March 2007                  [Page 24]

